app/views/posts/_post.html.erb

    <small>
      <%= post.hearts.count %> hearts
---
SELECT COUNT(*) FROM "hearts" WHERE "hearts"."post_id" = ?  [["post_id", 9]]