app/controllers/hearts_controller.rb

    def create
        @heart = Heart.new(heart_params)


        if @heart.save
---
INSERT INTO "hearts" ("post_id") VALUES (?)  [["post_id", 9]]